---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ
source: html/38caee8f-4f4f-ab62-68ae-4a380a1422eb.htm
---
# FieldDomainPointsByXYZ Members

Creates object from an array of three-dimensional point coordinates